app/controllers/oauth/googleauth_controller.rb

    def create
      oauth2 = Google::Apis::Oauth2V2::Oauth2Service.new
      access_token = params['accesstoken']
      userinfo = oauth2.tokeninfo(access_token: access_token)
      if userinfo.email.present?
        user = User.find_by_email(userinfo.email)
        if !user
            user = User.new(email: userinfo.email, password: params['accesstoken'].slice(0,10))
            user.save
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "ridds509@gmail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)