app/controllers/api/v1/todos_controller.rb

      def create
        @todo = current_user.todos.build(todo_params)

        if @todo.save
---
INSERT INTO "todos" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "reading"], ["user_id", 4], ["created_at", "2019-11-26 07:22:21.126399"], ["updated_at", "2019-11-26 07:22:21.126399"]]

      def set_todo
        @todo = current_user.todos.find(params[:id])
---
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ?  [["user_id", 4]]